TexasInstruments/mcupsdk-core-k3/test/drivers/ipc_notify_m4f/am62x-sk/a53ss0-1_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62x" --part "Default" --package "ALW" --context "a53ss0-1" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM625" --package "FCBGA (ALW)" --variant "AM6254-G" --context "a53ss0-1" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.26.2+4477"}
 */

/**
 * Import the modules used in this configuration.
 */
const ipc        = scripting.addModule("/drivers/ipc/ipc");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mmu_armv8  = scripting.addModule("/kernel/dpl/mmu_armv8", {}, false);
const mmu_armv81 = mmu_armv8.addInstance();
const mmu_armv82 = mmu_armv8.addInstance();
const mmu_armv83 = mmu_armv8.addInstance();
const mmu_armv84 = mmu_armv8.addInstance();
const mmu_armv85 = mmu_armv8.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
ipc.m4fss0_0           = "notify";
ipc.enableLinuxIpc     = false;
ipc.vringAllocationPDK = false;
ipc.r5fss0_0           = "notify";
ipc.a53ss0_0           = "notify";

debug_log.enableSharedMemLog = true;

mmu_armv81.size  = 0x80000000;
mmu_armv81.$name = "REGISTER_REGION";

mmu_armv82.attribute = "MAIR7";
mmu_armv82.$name     = "DDR";
mmu_armv82.size      = 0x2000000;
mmu_armv82.vAddr     = 0x8E000000;
mmu_armv82.pAddr     = 0x8E000000;

mmu_armv83.$name     = "AMP_SHM";
mmu_armv83.vAddr     = 0x99000000;
mmu_armv83.pAddr     = 0x99000000;
mmu_armv83.size      = 0x4000;
mmu_armv83.attribute = "MAIR7";

mmu_armv84.$name             = "ATF_REGION";
mmu_armv84.vAddr             = 0x82080000;
mmu_armv84.pAddr             = 0x82080000;
mmu_armv84.size              = 0x80000;
mmu_armv84.accessPermissions = "Privilege RO, User None";
mmu_armv84.shareable         = "Non Shareable";

mmu_armv85.$name     = "LOG_SHM_MEM";
mmu_armv85.vAddr     = 0xA1000000;
mmu_armv85.pAddr     = 0xA1000000;
mmu_armv85.size      = 0x40000;
mmu_armv85.attribute = "MAIR4";
